external/AB Performance.txt
Command:
	ab -n 100 -c 10 http://localhost:8091/
Response:
	This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
	Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
	Licensed to The Apache Software Foundation, http://www.apache.org/

	Benchmarking localhost (be patient).....done


	Server Software:        Banzai
	Server Hostname:        localhost
	Server Port:            8091

	Document Path:          /
	Document Length:        178 bytes

	Concurrency Level:      10
	Time taken for tests:   0.067 seconds
	Complete requests:      100
	Failed requests:        0
	Total transferred:      32400 bytes
	HTML transferred:       17800 bytes
	Requests per second:    1501.39 [#/sec] (mean)
	Time per request:       6.661 [ms] (mean)
	Time per request:       0.666 [ms] (mean, across all concurrent requests)
	Transfer rate:          475.05 [Kbytes/sec] received

	Connection Times (ms)
	              min  mean[+/-sd] median   max
	Connect:        0    0   0.2      0       1
	Processing:     2    6   6.0      4      25
	Waiting:        2    6   5.7      4      25
	Total:          3    6   6.0      4      26

	Percentage of the requests served within a certain time (ms)
	  50%      4
	  66%      5
	  75%      5
	  80%      5
	  90%     23
	  95%     24
	  98%     26
	  99%     26
	 100%     26 (longest request)

Command:
	ab -n 500 -c 10 http://localhost:8091/
Response:
	This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
	Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
	Licensed to The Apache Software Foundation, http://www.apache.org/

	Benchmarking localhost (be patient)
	Completed 100 requests
	Completed 200 requests
	Completed 300 requests
	Completed 400 requests
	Completed 500 requests
	Finished 500 requests


	Server Software:        Banzai
	Server Hostname:        localhost
	Server Port:            8091

	Document Path:          /
	Document Length:        178 bytes

	Concurrency Level:      10
	Time taken for tests:   0.231 seconds
	Complete requests:      500
	Failed requests:        0
	Total transferred:      162000 bytes
	HTML transferred:       89000 bytes
	Requests per second:    2167.91 [#/sec] (mean)
	Time per request:       4.613 [ms] (mean)
	Time per request:       0.461 [ms] (mean, across all concurrent requests)
	Transfer rate:          685.94 [Kbytes/sec] received

	Connection Times (ms)
	              min  mean[+/-sd] median   max
	Connect:        0    0   0.1      0       1
	Processing:     1    4   3.1      4      16
	Waiting:        1    4   2.8      3      16
	Total:          1    5   3.1      4      16

	Percentage of the requests served within a certain time (ms)
	  50%      4
	  66%      4
	  75%      5
	  80%      5
	  90%      7
	  95%     14
	  98%     15
	  99%     16
	 100%     16 (longest request)


Command:
	ab -n 500 -c 20 http://localhost:8091/
Response:
	This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
	Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
	Licensed to The Apache Software Foundation, http://www.apache.org/

	Benchmarking localhost (be patient)
	Completed 100 requests
	Completed 200 requests
	Completed 300 requests
	Completed 400 requests
	Completed 500 requests
	Finished 500 requests


	Server Software:        Banzai
	Server Hostname:        localhost
	Server Port:            8091

	Document Path:          /
	Document Length:        178 bytes

	Concurrency Level:      20
	Time taken for tests:   0.143 seconds
	Complete requests:      500
	Failed requests:        0
	Total transferred:      162000 bytes
	HTML transferred:       89000 bytes
	Requests per second:    3490.47 [#/sec] (mean)
	Time per request:       5.730 [ms] (mean)
	Time per request:       0.286 [ms] (mean, across all concurrent requests)
	Transfer rate:          1104.41 [Kbytes/sec] received

	Connection Times (ms)
	              min  mean[+/-sd] median   max
	Connect:        0    0   0.2      0       2
	Processing:     1    5   3.8      4      18
	Waiting:        1    4   3.2      3      18
	Total:          1    6   3.8      4      18

	Percentage of the requests served within a certain time (ms)
	  50%      4
	  66%      5
	  75%      7
	  80%     10
	  90%     11
	  95%     14
	  98%     16
	  99%     17
	 100%     18 (longest request)


Command:
	ab -n 500 -c 50 http://localhost:8091/
Response:
	This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
	Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
	Licensed to The Apache Software Foundation, http://www.apache.org/

	Benchmarking localhost (be patient)
	Completed 100 requests
	Completed 200 requests
	Completed 300 requests
	Completed 400 requests
	Completed 500 requests
	Finished 500 requests


	Server Software:        Banzai
	Server Hostname:        localhost
	Server Port:            8091

	Document Path:          /
	Document Length:        178 bytes

	Concurrency Level:      50
	Time taken for tests:   0.122 seconds
	Complete requests:      500
	Failed requests:        0
	Total transferred:      162000 bytes
	HTML transferred:       89000 bytes
	Requests per second:    4110.93 [#/sec] (mean)
	Time per request:       12.163 [ms] (mean)
	Time per request:       0.243 [ms] (mean, across all concurrent requests)
	Transfer rate:          1300.72 [Kbytes/sec] received

	Connection Times (ms)
	              min  mean[+/-sd] median   max
	Connect:        0    1   0.5      0       2
	Processing:     1   11   5.1     11      25
	Waiting:        1    9   4.4      8      19
	Total:          3   12   5.0     11      25
	WARNING: The median and mean for the initial connection time are not within a normal deviation
	        These results are probably not that reliable.

	Percentage of the requests served within a certain time (ms)
	  50%     11
	  66%     15
	  75%     16
	  80%     16
	  90%     18
	  95%     19
	  98%     22
	  99%     24
	 100%     25 (longest request)

AB